import discord
import random
import asyncio
from discord.ext import commands

intents = discord.Intents.default()
intents.members = True
intents.message_content = True

bot = commands.Bot(command_prefix='!', intents=intents)
@bot.command()
async def randomno(ctx):
  a = random.randint(1,7)
  if a == 1:
   await betterbuy(ctx)
  if a == 2:
   await problemplastic(ctx)
  if a == 3:
   await plastic(ctx)
  if a == 4:
   await saveekologia(ctx)
  if a == 5:
   await pererabotka(ctx)
  if a == 6:
   await russiaplan(ctx)
  if a == 7:
    await bottles(ctx)
@bot.command()
async def start(ctx):
  await ctx.send(f'Привет я Бот! Я дам тебе советы для улучшения экологии и так же расскажу некоторые факты! Команда help чтобы увидеть мои команды!')
@bot.command()
async def betterbuy(ctx):
  await ctx.send(f'При покупке продуктов, и особенно овощей и фруктов, отдайте предпочтение лежащим россыпью, а не упакованным в пластик. Тут вы можете вручную выбрать каждое яблоко или апельсин, а не брать то, что вам заранее положили и упаковали. То же самое с хлебом. Свежевыпеченный лежит без упаковки, а в целлофане – хлеб не первой свежести, может быть, и не сегодняшний. Купите свежеотрезанный кусок мяса у мясника, рыбу – у рыбника, сыр – у продавца сыра и положите купленное в принесенный с собой контейнер. Пометьте контейнеры для сырых рыбы и мяса, и всегда используйте их только для этих продуктов. В лавках фрукты и ягоды часто продают насыпанными в пластиковые контейнеры с дырочками на дне – так их легче отмерить без взвешивания. Пересыпьте их дома в многоразовые контейнеры, а купленные верните лавочнику при следующем визите к нему. Он только скажет вам «спасибо» за это, потому что эти контейнеры ему приходится покупать.!')
 
@bot.command()
async def problemplastic(ctx):
  await ctx.send('Пластик критикуют за короткий срок службы. Если оценивать жизненный цикл материала, то экологические издержки пластика в четыре раза ниже, чем у металла, картона или бумаги. Главная проблема не в том, как мир использует пластик, а куда он отправляется из мусорных контейнеров. Каждый год в России образуется около 3000000 т пластиковых отходов.')
   
@bot.command()
async def plastic(ctx):
    await ctx.send(f'С 50-х годов планета произвела 8,3 миллиарда тонн пластика. Если ситуацию не изменить, то к 2050 году будет произведено 34 миллиарда тонн: в океане будет больше пластика, чем рыбы!')

@bot.command()
async def saveekologia(ctx):
    await ctx.send(f'Сохраните природу не выбрасывайте мусор на природе!')

@bot.command()
async def pererabotka(ctx):
  await ctx.send('Процесс переработки пластика состоит из нескольких этапов: сбор, сортировка, измельчение, промывка и гранулирование. Сортировка происходит вручную или автоматически. Она помогает избавиться от загрязненных элементов из всего потока отходов. После этого пластик измельчают на хлопья, а затем перерабатывают в гранулы путем нагревания.Производственная линия предприятий по переработке состоит из специального оборудования общей стоимостью до ₽10 млн. Обычно в линию входят:конвейерная лента;этикеточный сепаратор;сортировочныйконвейер;аппараты длямытья и полоскания;дробилка;промывочные бассейны;шнековый загрузчик;гранулятор;резочная машина;центрифуга или пневмосушилка;упаковочная машина;За 8-часовой рабочий день благодаря этому оборудованию можно создать до 4 т пластикового гранулята, а это 88 т в месяц (с учетом выходных дней). Стоимость одной тонны готового материала составляет ₽30 тыс. Продав полученный гранулят, производитель сможет выручить более ₽3,5 млн. Прибыль после вычета обязательных расходов (покупка пластикового сырья, аренда помещения, заработная плата сотрудникам и другие расходы) составит ₽720 тыс. После уплаты налогов у переработчика останется ₽612 тыс. чистой прибыли. Гранулят пользуется спросом среди предприятий всех сфер промышленности. Реализовывать их можно, например, производителям контейнеров и упаковочных средств, ПЭТ-бутылок, вентиляционных каналов, труб и пластиковой мебели. Пластик также активно используется фабриками по созданию синтетических тканей.')

@bot.command()
async def russiaplan(ctx):
  await ctx.send('К 2024 году в России появятся 210 заводов по переработке отходов. Такими планами поделились российские власти. По данным Минприроды РФ, в стране сейчас работают около 80 заводов по переработке пластика. В ближайшие несколько лет владельцы этих предприятий намерены увеличить свою загрузку. Как пояснил исполнительный директор ассоциации «Русбренд» Алексей Поповичев, нехватка сырья пока мешает увеличить обороты производства.Не работает на полную мощь и завод, который перерабатывает пластик по уникальной технологии bottle-to-bottle. Ее использует лишь одно предприятие — «Пларус». Он открылся в 2007 году в Солнечногорске. Ресурсов предприятия хватает, чтобы переработать до 2 500 т пластиковых бутылок. После переработки бутылки становятся ПЭТ-гранулятом. Его используют для создания новых емкостей для напитков.')

@bot.command()
async def bottles(ctx):
    await ctx.send(f'Каждую минуту в мире покупают один миллион пластиковых бутылок. Каждый год используется пять триллионов одноразовых пакетов. По прогнозам экспертов, производство пластика к 2025 году вырастет до 500 миллионов тонн в год. Из всего когда-либо произведённого пластика переработано только девять процентов, и половина всего пластика в мире выбрасывается сразу после первого использования. К счастью, ситуация начинает меняться и в мире, и в нашей стране. !')

bot.run("")